openfoam3/case_medium_real/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}

type sets;
libs ("libsampling.so");

interpolationScheme cellPoint;
setFormat raw;
writeControl writeTime;

sets
(
    line
    {
        type    uniform;
        axis    xyz;
        start   (0.61 0.01 0.05);
        end     (2.99 0.01 0.05);
        nPoints 200;
    }
);

fields ( p U );
